Show / Hide Table of Contents
Class SteelSetup
ISteelSetup
Inheritance
System.Object
SteelSetup
SteelSetupAISC
SteelSetupAUS
SteelSetupCISC
SteelSetupECEN
SteelSetupHKG
SteelSetupIND
SteelSetupRUS
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
[KnownType(typeof(SteelSetupECEN))]
[KnownType(typeof(SteelSetupAISC))]
[KnownType(typeof(SteelSetupCISC))]
[KnownType(typeof(SteelSetupAUS))]
[KnownType(typeof(SteelSetupRUS))]
[KnownType(typeof(SteelSetupIND))]
[KnownType(typeof(SteelSetupHKG))]
public abstract class SteelSetup
Methods
Improve this Doc   View Source
FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
Declaration
public virtual double FrictionCoefficientPboltDefault()
Returns
 Type |  Description
 System.Double
 Improve this Doc
 View Source